{"High Income Professionals": "Individuals with high consumption levels, typically in high-paying jobs such as finance or specialized engineering.", "Creative Occupations": "Individuals engaged in creative roles, primarily in writing and marketing, contributing to various sectors.", "Female IT Engineers": "Female professionals primarily working as IT engineers, showing a mix of consumption levels.", "Sales and Marketing": "Individuals focused on sales with a customer-oriented approach, typically in online sales.", "Education and Training": "Professionals dedicated to teaching and training, emphasizing knowledge transfer and skill development.", "Administrative Professionals": "Individuals working in administrative roles who support organizational functions, typically showing moderate consumption levels but not closely aligned with high-income or creative occupations.", "Technical Specialists": "Individuals with advanced degrees working in specialized technical roles, demonstrating moderate consumption levels and a focus on technical proficiency.", "Front Desk Professionals": "Individuals working in front desk and reception roles, often focused on customer service and administrative support, showing moderate to high levels of consumption but not strongly aligned with any high-income or specialized technical groups.", "Low Income Entry-Level Workers": "Individuals with minimal education and lower consumption levels, typically in entry-level roles or positions that do not require advanced qualifications, contributing to basic operational functions.", "Non-Traditional Investors": "Individuals, often without advanced education, who engage in investment activities with high consumption levels, typically operating outside conventional professional roles.", "Advanced Technical Workers": "Individuals with advanced degrees, primarily engaged in specialized technical roles, often exhibiting high consumption levels and a strong focus on technical skills and knowledge applications."}