{
    "Highly Educated Professionals": "Individuals with bachelor degrees or higher, working in professional roles with a focus on higher-level responsibilities.",
    "Moderately Educated Workers": "Individuals with secondary education or vocational training working in various professional and service roles.",
    "Labour and Community Service Workers": "Primarily female workers in community services and labor roles, focusing on social support and manual work.",
    "Entry-Level and Unknown Education": "Individuals with less formal education or those whose education status is not specified, often in entry-level or undefined roles.",
    "Administrative and Support Roles": "This group contains no entries; it may represent positions not included in the provided data.",
    "Undefined and Unclassified Roles": "Individuals whose education or job classification is unclear, potentially lacking formal education or belonging to various undefined job roles.",
    "Undefined or Unclassified Professionals": "Individuals whose education level is not clearly specified but are engaged in professional roles, potentially lacking formal recognition or documentation of their qualifications.",
    "Unclassified Professionals": "Individuals who have professional roles but whose educational background is not clearly defined, often implying a mix of informal education or varied experience.",
    "Unlikely Educational Fit": "Individuals with education levels that do not align with their job roles, particularly indicating a disconnect between high education credentials and labor-intensive positions.",
    "Mechanical and Skilled Operators": "Individuals who possess technical skills and operate machinery or vehicles, often with certifications or vocational training, but may not necessarily hold a formal higher education degree.",
    "Unskilled and Underqualified Individuals": "Individuals with little to no formal education, working in roles that do not require specialized skills or qualifications, often in precarious employment situations.",
    "Underrepresented Educational Roles": "Individuals with qualifications that do not fit into traditional education levels, often occupying niche positions that require specific skills or certifications but lack wider recognition in established educational classifications.",
    "Unclassified or Non-Specified Roles": "Individuals with non-specific educational backgrounds and job roles that do not fit into traditional categories, possibly including underemployment or roles lacking clear classification.",
    "Specialized Skilled Workers": "Individuals who possess a bachelor degree or higher and work in specialized roles such as machinery operation and driving, indicating a blend of education and technical skill.",
    "Machinery and Vehicle Operators": "Individuals who operate machinery and vehicles, typically requiring specific skills and training, but not always associated with high levels of formal education. This group may overlap with entry-level roles, but includes those with vocational training or practical experience.",
    "Low Education Clerical Workers": "Individuals with Year 9 or below education engaged in clerical and administrative roles, often indicating a significant mismatch between their formal education and job expectations. They may face challenges due to limited educational qualifications, resulting in underemployment and potential undervaluation in their positions.",
    "Low Educational Attainment Workers": "Individuals with limited formal education, often in low-skilled and entry-level positions, with a focus on basic job functions lacking specialized training.",
    "Underqualified or Non-Specified Roles": "Individuals with limited formal education or qualifications, often in positions that do not require advanced skills or education. This group may include entry-level roles or jobs where the education status is not clearly defined.",
    "Unspecified Management Professionals": "Individuals in managerial roles whose educational background or specific qualifications are not clearly defined, indicating a potential for diverse educational paths and experiences.",
    "Undefined Professional Roles": "Individuals in managerial positions whose education status is unclear, with a diverse range of responsibilities that do not fit neatly into established categories.",
    "Ambiguous Education and Occupation Group": "Individuals whose education status and job classification lack clarity, potentially falling into undefined or informal roles without clear pathways to recognition within established categories.",
    "Highly Skilled Operators and Drivers": "Individuals with higher education, specifically bachelor degrees or above, working in skilled machinery operation and driving roles, indicating a blend of higher education with specialized practical expertise.",
    "Ambiguous Professionals": "Individuals whose job roles are somewhat professional but lack clear educational qualifications or classification, leading to uncertainty in their alignment with established groups.",
    "Specialized Machinery Operators": "Individuals with specialized skills in operating machinery, often requiring technical knowledge and training, but not necessarily formal higher education.",
    "Low Educational Fit in Technical Roles": "Individuals with limited formal education (Year 9 or below) working in technical or trade-related jobs, often struggling to meet the skills and education required for advancement in these fields.",
    "Underqualified Entry-Level Professionals": "Individuals with marginal formal education, such as Year 12, who occupy professional roles but may lack the qualifications needed for higher-level responsibilities. This group often reflects a disconnect between educational attainment and job expectations, leading to a potential underutilization of skills.",
    "Low Probability Classification": "Individuals whose role or education status is unclear, with insufficient information to place them confidently within established groups.",
    "Low Educational and Professional Alignment Individuals": "Individuals with basic educational qualifications (Year 12) but engaged in professional roles that may not fully utilize their skills or education, indicating a potential mismatch or underemployment in their career paths.",
    "Low Educational Attainment Professionals": "Individuals with Year 12 education or equivalent, occupying professional roles that may not require advanced education or specific qualifications. Often involved in entry-level professional tasks, potentially with some vocational training or informal experience.",
    "Ambiguous Management Roles": "Individuals in managerial positions whose educational background is unspecified, often reflecting a blend of experience and informal qualifications rather than formal education. This group may include females in management but lacks clear alignment with traditional educational classifications.",
    "Specialized Trades Workers": "Individuals with specialized training or degrees operating machinery and vehicles, often in technical or skilled labor roles, that require specific expertise but do not fall within typical professional categories.",
    "Unclassified Professionals with Ambiguous Education": "Individuals engaged in professional roles without clearly defined educational backgrounds, potentially lacking formal documentation of their qualifications. This group may include professionals who do not fit neatly into existing classifications due to discrepancies in job titles or education status.",
    "Ambiguous Educational Professionals": "Individuals with varying levels of education, such as diplomas or advanced diplomas, whose roles may not align clearly with established professional categories, resulting in uncertainty regarding their educational fit and job classification.",
    "Marginally Qualified Technicians": "Individuals with some technical skills or vocational training but lacking formal recognition or qualifications. This group includes females who are engaged in technical or trades worker roles but may not fully meet the educational requirements for higher-level responsibilities, reflecting a disconnect between their skill sets and job expectations.",
    "Low Probability Clerical Workers": "Individuals engaged in clerical and administrative roles with unclear educational backgrounds and limited qualifications, often facing challenges due to insufficient education and potential underemployment.",
    "Underqualified Administrative Workers": "Individuals with a Bachelor's degree or higher who are engaged in clerical and administrative roles but may not fully utilize their education, indicating a potential mismatch between their qualifications and job responsibilities.",
    "Underqualified or Non-Specified Managers": "Individuals in managerial positions with limited formal education (Year 9 or below), lacking clear qualifications or formal recognition of their roles. This group reflects the potential for individuals to occupy management roles without the necessary educational credentials, highlighting a disconnect between job responsibilities and educational attainment.",
    "Low Educational Fit in Professional Roles": "Individuals with Year 9 or below education who occupy professional roles, indicating a significant mismatch between their formal education and the professional expectations of their job. This group reflects the challenges faced by those who may be overqualified for their work or lack the necessary qualifications for advancement.",
    "Unqualified and Underspecified Professionals": "Individuals engaged in professional roles but have minimal formal education (Year 9 or below) and lack clear qualifications. This group reflects a mismatch between job expectations and educational attainment, often leading to underutilization of skills.",
    "Underqualified Management Individuals": "Individuals in managerial positions with limited formal education, reflecting a disconnect between job responsibilities and educational qualifications. This group often faces challenges in fulfilling managerial duties and may experience underutilization of their skills.",
    "Undefined Professionals with Limited Education": "Individuals who are engaged in professional roles but have no formal educational attainment. This group reflects a significant disconnect between job expectations and educational qualifications, often leading to underemployment and utilization of skills in roles that may not fully acknowledge their responsibilities.",
    "Marginally Qualified Administrative Workers": "Individuals with a bachelor degree or higher engaged in clerical and administrative roles who may not fully utilize their education, suggesting a potential mismatch between their qualifications and job responsibilities.",
    "Underqualified or Misaligned Professionals": "Individuals with a bachelor degree or higher engaged in community and personal service roles, but whose education is not fully utilized in their job responsibilities, indicating a potential mismatch between educational attainment and professional suitability.",
    "Underqualified and Underspecified Managers": "Individuals in managerial positions with no formal educational attainment, indicating a disconnect between their job responsibilities and educational qualifications, often leading to challenges in fulfilling required managerial duties.",
    "Underqualified Professionals": "Individuals, primarily male, with Year 9 or below education, engaged in professional roles, indicating a significant disconnect between their formal education and job responsibilities. This group reflects the challenges faced by those occupying professional positions without adequate educational qualifications, often leading to underemployment and underutilization of their skills.",
    "Low Educational Attainment Clerical Workers": "Individuals engaged in clerical and administrative roles with limited formal education, often facing challenges in fulfilling job responsibilities due to inadequate educational qualifications. This group reflects a potential disconnect between educational attainment and job expectations, indicating underemployment and limited opportunities for skill utilization.",
    "Ambiguous Sales Professionals": "Individuals, predominantly female, with a Bachelor Degree or higher engaged in sales roles. This group reflects a potential disconnect between their educational qualifications and the sales profession, indicating challenges in utilizing higher education in a role that may typically require less formal education.",
    "Undefined or Ambiguous Managers": "Individuals in managerial positions whose educational background is unclear or unspecified. This group indicates a potential lack of formal qualifications while occupying leadership roles, highlighting a disconnect between managerial responsibilities and educational attainment.",
    "Underqualified Managers": "Individuals in managerial roles with limited formal education (up to Year 12), reflecting a potential mismatch between their job responsibilities and educational qualifications. This group often faces challenges in fulfilling managerial duties due to insufficient educational background and may experience underutilization of their skills.",
    "Low Educational Attainment Managers": "Individuals in managerial positions with limited formal education (up to Year 10), reflecting a potential mismatch between their job responsibilities and educational qualifications. This group highlights the challenges faced by those who occupy leadership roles without the necessary educational credentials, possibly indicating underutilization of skills and difficulties in fulfilling managerial duties.",
    "Low Probability Professionals": "Individuals with a Certificate level III qualification who are engaged in professional roles, indicating a potential mismatch between their educational attainment and job expectations. This group often reflects underemployment and may not fully utilize their skills or education within their positions.",
    "Ambiguous Managerial Roles": "Individuals in managerial positions whose educational background is unspecified or unclear, reflecting a potential lack of formal qualifications while occupying leadership roles. This group highlights the disconnect between responsibilities and educational attainment, particularly in female roles.",
    "Marginally Recognized Managerial Roles": "Individuals in managerial positions with vocational certifications, indicating a potential mismatch between their educational qualifications and job responsibilities. This group often reflects a gap in formal leadership training and may face challenges in leveraging their skills effectively within organizational structures.",
    "Low Probability Sales and Service Workers": "Individuals, often female, working in sales roles with unclear educational backgrounds and qualifications. They may not fully utilize their skills and education in their positions, reflecting a potential mismatch between job expectations and formal training.",
    "Underqualified Clerical Professionals": "Individuals with a Bachelor Degree or higher engaged in clerical and administrative roles, suggesting a potential mismatch between their educational qualifications and job responsibilities. This group indicates that highly educated individuals may be working in positions that do not fully utilize their skills or education.",
    "Underqualified and Misaligned Professionals": "Individuals with a bachelor's degree or higher who are engaged in clerical and administrative roles, reflecting a potential mismatch between their educational qualifications and job responsibilities. This group highlights the challenges of educated individuals working in positions that do not fully utilize their skills or education, leading to underemployment.",
    "Highly Educated Labourers": "Individuals, typically male, who possess a Bachelor's degree or higher but are engaged in labor-intensive roles, reflecting a potential mismatch between their educational qualifications and job responsibilities. This group highlights the challenges faced by educated individuals in finding roles that align with their skills and education.",
    "Marginal Professionals": "Individuals with limited formal qualifications, such as Certificate level III, engaged in professional roles that often do not fully utilize their skills or education. This group reflects a disconnect between their educational attainment and job expectations, leading to potential underemployment and undervaluation of their capabilities.",
    "Underqualified Labourers with Higher Education": "Individuals who possess a Bachelor Degree or higher but are engaged in labor roles, reflecting a disconnect between their educational qualifications and job responsibilities. This group may face challenges in finding roles that utilize their skills or align with their educational background.",
    "Underutilized Female Graduates in Clerical Roles": "This group consists of women who hold a Bachelor Degree or higher and work in clerical and administrative positions. Despite their educational qualifications, they often face challenges in finding roles that fully utilize their skills and education, leading to potential underemployment and a mismatch between their qualifications and job responsibilities.",
    "Marginal Professionals with Limited Education": "Individuals with Year 10 education engaged in professional roles, indicating a potential mismatch between their educational qualifications and job responsibilities. This group often reflects underemployment and a lack of appropriate roles that fully utilize their skills and knowledge.",
    "Underqualified Managers with Advanced Diplomas": "Individuals in managerial positions who hold advanced diplomas or diplomas but may lack the necessary qualifications for higher-level responsibilities. This group reflects a potential mismatch between their educational qualifications and job expectations, indicating underemployment and challenges in fulfilling managerial duties.",
    "Underqualified Managers Without Formal Education": "Individuals in managerial positions lacking formal educational attainment, reflecting a potential mismatch between job responsibilities and educational qualifications. This group often faces challenges in performing managerial duties due to insufficient educational background.",
    "Low Educational Fit Clerical Workers": "Individuals with Year 9 or below education engaged in clerical and administrative roles, reflecting a significant mismatch between their formal education and job expectations. This group faces challenges in fulfilling the responsibilities of their positions due to limited educational qualifications.",
    "Low Engagement Sales Workers": "Individuals working in sales roles with undefined educational backgrounds and limited qualifications, reflecting a potential mismatch between job expectations and educational attainment, often leading to underemployment and undervaluation of their capabilities.",
    "Underqualified Operators": "Individuals, primarily female, who possess no formal educational attainment but occupy roles in machinery operation and driving. This group reflects a significant gap between educational qualifications and job expectations, often leading to underemployment in skilled operational roles.",
    "Low Educational Fit in Sales Roles": "Individuals, primarily female, with Year 9 or below education working in sales positions, indicating a significant mismatch between their formal education and the expectations of their job. This group reflects challenges faced by individuals in utilizing their skills and education effectively within sales environments.",
    "Undefined or Misclassified Professionals": "Individuals who engage in professional roles despite lacking formal educational attainment. This group consists mainly of women who may face challenges in finding roles that align with their skills and expertise, leading to potential underemployment and ambiguity in their professional identity.",
    "Underqualified Sales Workers": "Individuals engaged in sales roles who lack clear educational backgrounds or formal qualifications. This group often reflects a disconnect between job expectations and educational attainment, leading to potential underemployment and underutilization of skills.",
    "Underutilized Highly Educated Clerical Workers": "This group consists of highly educated individuals, primarily male, holding a Bachelor Degree or higher who are engaged in clerical and administrative roles. Despite their advanced educational qualifications, they often face challenges in finding roles that fully utilize their skills and education, leading to potential underemployment and a mismatch between their qualifications and job responsibilities.",
    "Low-Qualified Female Technicians and Trades Workers": "This group consists of females with Year 9 or below education engaged in technical and trades worker roles. They typically face challenges in fulfilling the responsibilities of their positions due to limited formal education and may encounter underemployment and a lack of opportunities for skill utilization and advancement.",
    "Marginally Qualified Managers": "Individuals in managerial positions with limited formal education (Year 12), often facing challenges in fulfilling their job responsibilities due to a gap between their educational qualifications and managerial expectations. This group reflects the underutilization of their skills and potential within organizational structures.",
    "Undefined or Ambiguous Roles": "Individuals whose education or job classification is unclear, often lacking formal education or belonging to various undefined job roles. This group reflects a potential lack of recognition in established educational categories, possibly including individuals who face challenges in aligning their skills and qualifications with job expectations.",
    "Underrepresented Professionals": "Individuals, primarily male, engaged in professional roles with unclear or unspecified educational backgrounds, reflecting a potential disconnect between their job responsibilities and educational qualifications. This group may face challenges in leveraging their skills effectively and might be underutilized in their positions.",
    "Underqualified Managers with Certificate Level IV": "Individuals in managerial positions who hold a Certificate level IV but may lack higher formal education or the necessary qualifications for advanced management roles. This group highlights the challenges faced by individuals occupying leadership positions without adequate educational credentials, reflecting potential underutilization of skills and capabilities.",
    "Ambiguous Professional Roles": "Individuals who occupy professional positions but have unclear or unspecified educational backgrounds. This group may face challenges in aligning their skills and qualifications with job expectations, often reflecting a potential disconnect between job responsibilities and formal education.",
    "Undefined Professionals": "Individuals whose professional roles are inadequately described or lack clear classification. This group may include individuals with ambiguous educational backgrounds and job descriptions, leading to challenges in aligning skills and responsibilities.",
    "Unspecified or Ambiguous Managers": "Individuals in managerial positions whose educational background is unclear or unspecified, often lacking formal qualifications. This group highlights a potential disconnect between managerial responsibilities and educational attainment, leading to challenges in fulfilling job duties effectively.",
    "Underqualified Professional Managers": "Individuals who occupy managerial roles but possess only Year 12 educational qualifications. This group reflects a disconnect between job responsibilities and educational attainment, often facing challenges in fulfilling managerial duties and potentially experiencing underemployment.",
    "Inadequately Described Professionals": "This group consists of individuals engaged in professional roles but lacking clear or comprehensive educational and job classifications. They may face challenges in aligning their skills and qualifications with job expectations, indicating potential underemployment and underutilization of their capabilities.",
    "Low Probability Managers": "Individuals, primarily female, with Year 12 education who occupy managerial positions but may face challenges fulfilling their responsibilities due to a potential mismatch between their educational qualifications and the expectations of their roles. This group reflects underutilization of skills and a lack of formal qualifications necessary for effective management.",
    "Underqualified Technicians and Trades Workers": "Individuals, primarily male, possessing a Bachelor Degree or higher and engaged in technical or trades roles. They often experience a disconnect between their educational qualifications and job responsibilities, indicating potential underemployment and challenges in fulfilling the requirements of their positions.",
    "Ambiguously Qualified Managers": "Individuals in managerial positions where the educational background is unclear or unspecified. This group often consists of males and reflects the potential for instability and uncertainty within managerial roles due to the lack of specific educational qualifications.",
    "Underqualified Managers with Limited Education": "Individuals in managerial roles with Year 11 education, often reflecting a potential mismatch between their job responsibilities and educational qualifications. This group may face challenges in fulfilling managerial duties due to inadequate educational background and may experience underutilization of their skills.",
    "Undefined or Misclassified Managers": "Individuals in managerial positions with unclear educational backgrounds and unspecified qualifications. This group may lack formal recognition or training related to their roles, leading to potential challenges in effectively fulfilling their managerial responsibilities.",
    "Unsuitable Education and Employment Group": "Individuals with no formal educational attainment engaged in undefined or low-skilled roles, often struggling to find suitable employment that aligns with their potential and skills. This group reflects a significant disconnect between their educational background and job opportunities, indicating challenges in attaining equitable recognition and advancement in the labor market.",
    "Undefined and Ambiguous Roles": "Individuals whose education or job classification is unclear, often lacking formal education or belonging to various undefined job roles. This group reflects a potential lack of recognition in established educational categories.",
    "Underqualified Technicians in Trades Roles": "Individuals, primarily male, with Year 12 educational qualifications engaged in technical or trades positions but lacking the necessary skills or formal training. This group often faces challenges in fulfilling job responsibilities and may experience underemployment, indicating a disconnect between their educational background and job expectations.",
    "Underqualified Managerial Professionals": "Individuals holding Advanced Diplomas or Diplomas in professional roles but whose qualifications may not reflect the necessary educational credentials typically required for higher-level responsibilities. This group encompasses those who may experience a disconnect between their formal education and job expectations, leading to potential underemployment or challenges in effectively fulfilling their roles.",
    "Undefined and Low Educational Fit Workers": "Individuals, primarily females, lacking formal educational attainment and engaged in clerical or administrative roles. This group reflects a significant disconnect between their educational qualifications and job expectations, often resulting in underemployment and challenges in fulfilling job responsibilities due to insufficient education.",
    "Undefined and Low Probability Professionals": "Individuals who engage in professional roles but lack clear educational backgrounds or qualifications. This group typically faces challenges in aligning their skills and roles, often resulting in underemployment and a lack of recognition in established professional categories.",
    "Underqualified and Ambiguous Clerical Workers": "Individuals, primarily female, who are engaged in clerical and administrative roles but lack clear educational qualifications. They often face challenges in fulfilling job responsibilities due to insufficient education and may experience underemployment and a lack of recognition in established categories.",
    "Undefined Low Educational Managers": "Individuals, primarily female, who occupy managerial roles without formal educational attainment. This group reflects significant challenges in fulfilling managerial responsibilities due to a lack of necessary qualifications and may experience underemployment while facing difficulties in leveraging their skills effectively.",
    "Underclassed and Misaligned Professionals": "Individuals, primarily female, holding Certificate level III qualifications but engaged in professional roles that may not fully utilize their skills or education. This group reflects a significant disconnect between their educational attainment and job responsibilities, often resulting in underemployment and challenges in recognizing their professional capabilities.",
    "Undefined and Ambiguous Sales Workers": "Individuals working in sales roles with unclear educational backgrounds and qualifications, reflecting a potential disconnect between job expectations and educational attainment, often leading to underemployment and undervaluation of their capabilities."
}